

import treePlotter
from pylab import *
mpl.rcParams['font.sans-serif'] = ['SimHei']  # 指定默认字体
mpl.rcParams['axes.unicode_minus'] = False  # 解决保存图像时负号'-'显示为方块的问题

# treePlotter2.createPlot(myTree)


def createDataSet():
	dataSet = [['青年', '否', '否', '一般', '拒绝'],
				['青年', '否', '否', '好', '拒绝'],
				['青年', '是', '否', '好', '同意'],
				['青年', '是', '是', '一般', '同意'],
				['青年', '否', '否', '一般', '拒绝'],
				['中年', '否', '否', '一般', '拒绝'],
				['中年', '否', '否', '好', '拒绝'],
				['中年', '是', '是', '好', '同意'],
				['中年', '否', '是', '非常好', '同意'],
				['中年', '否', '是', '非常好', '同意'],
				['老年', '否', '是', '非常好', '同意'],
				['老年', '否', '是', '好', '同意'],
				['老年', '是', '否', '好', '同意'],
				['老年', '是', '否', '非常好', '同意'],
				['老年', '否', '否', '一般', '拒绝'],
				]
	# feature_index = ['年龄', '有工作', '有房子', '信贷情况']
	feature_index=[0,1,2,3]
	return dataSet,feature_index
